In [1]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])

# Selecting

In [5]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [6]:
obj['b']

1.0

In [9]:
obj[3]

3.0

In [12]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [15]:
obj[['a','b']]

a    0.0
b    1.0
dtype: float64

In [16]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

# Filtering

In [17]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

# Slicing

In [18]:
obj['c':'d']

c    2.0
d    3.0
dtype: float64

In [19]:
obj['c':'d'] =5

In [20]:
obj

a    0.0
b    1.0
c    5.0
d    5.0
dtype: float64

In [22]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four']        
                            )

In [23]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [26]:
data[['two','three','one']]

          two  three  one
Ohio        1      2    0
Colorado    5      6    4
Utah        9     10    8
New York   13     14   12

In [32]:
data[0:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [33]:
data['Ohio':'Utah']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [40]:

data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Selecting with loc and iloc

In [41]:
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [42]:
data.loc['Colorado', ['three', 'four']]

three    6
four     7
Name: Colorado, dtype: int32

In [46]:
data.iloc[1, [3,2]]

four     7
three    6
Name: Colorado, dtype: int32

In [47]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [48]:
data.iloc[[1,2], [1,2]]

          two  three
Colorado    5      6
Utah        9     10

In [51]:
data.loc[:'Utah', ['one', 'two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9

In [53]:
data.iloc[:2,[0,1]][data.two < 5]

c:\program files\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

      one  two
Ohio    0    1